#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/micropay/gh-actions/runs/run-s2MKToSXew9Nsqjq

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudfront_distribution.distribution will be created
  + resource "aws_cloudfront_distribution" "distribution" {
      + aliases                        = [
          + "micropay.gg",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "tf-nextjs-micropay-web"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + custom_error_response {
          + error_caching_min_ttl = 60
          + error_code            = 403
          + response_code         = 404
          + response_page_path    = "/404"
        }

      + default_cache_behavior {
          + allowed_methods          = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id          = (known after apply)
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = true
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "216adef6-5c7f-47e4-b989-5492eafa07d3"
          + target_origin_id         = "tf-next-s3-static-content"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "redirect-to-https"

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }

      + ordered_cache_behavior {
          + allowed_methods          = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id          = (known after apply)
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = true
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = (known after apply)
          + path_pattern             = "/_next/image*"
          + target_origin_id         = "tf-next-image-optimizer"
          + viewer_protocol_policy   = "redirect-to-https"
        }
      + ordered_cache_behavior {
          + allowed_methods          = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id          = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = true
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "88a5eaf4-2fd4-4709-b370-b4c650ea3fcf"
          + path_pattern             = "/_next/static/*"
          + target_origin_id         = "tf-next-s3-static-content"
          + viewer_protocol_policy   = "redirect-to-https"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "tf-next-s3-static-content"

          + custom_header {
              + name  = "x-env-api-endpoint"
              + value = (known after apply)
            }
          + custom_header {
              + name  = "x-env-config-endpoint"
              + value = (known after apply)
            }

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "tf-next-image-optimizer"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }

          + origin_shield {
              + enabled              = true
              + origin_shield_region = "us-west-2"
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          + cloudfront_default_certificate = false
          + minimum_protocol_version       = "TLSv1"
          + ssl_support_method             = "sni-only"
        }
    }

  # aws_route53_record.cloudfront_alias_domain will be created
  + resource "aws_route53_record" "cloudfront_alias_domain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "micropay.gg"
      + type            = "A"
      + zone_id         = "Z0654085V5EAR601WU0T"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.cloudfront_cert.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "micropay.gg"
      + domain_validation_options = [
          + {
              + domain_name           = "micropay.gg"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "Name" = "CloudFront micropay.gg"
        }
      + tags_all                  = {
          + "Name" = "CloudFront micropay.gg"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.cloudfront_cert.aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.cloudfront_cert.aws_route53_record.validation[0] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0654085V5EAR601WU0T"
    }

  # module.tf_next.data.aws_iam_policy_document.access_static_deployment will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "access_static_deployment"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.tf_next.aws_cloudfront_cache_policy.this will be created
  + resource "aws_cloudfront_cache_policy" "this" {
      + comment     = "Managed by Terraform Next.js"
      + default_ttl = 86400
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 31536000
      + min_ttl     = 0
      + name        = "tf-nextjs-micropay-web_tfn-cache"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + enable_accept_encoding_brotli = true
          + enable_accept_encoding_gzip   = true

          + cookies_config {
              + cookie_behavior = "all"
            }

          + headers_config {
              + header_behavior = "whitelist"

              + headers {
                  + items = [
                      + "Authorization",
                      + "host",
                    ]
                }
            }

          + query_strings_config {
              + query_string_behavior = "all"
            }
        }
    }

  # module.tf_next.aws_cloudwatch_log_group.this["__NEXT_API_LAMBDA_0"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/tf-nextjs-micropay-web___NEXT_API_LAMBDA_0"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.tf_next.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn         = (known after apply)
      + description = "Managed by Terraform Next.js"
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.tf_next.aws_iam_role.lambda["__NEXT_API_LAMBDA_0"] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Managed by Terraform Next.js"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tf-nextjs-micropay-web___NEXT_API_LAMBDA_0"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.tf_next.aws_iam_role_policy_attachment.lambda_logs["__NEXT_API_LAMBDA_0"] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tf-nextjs-micropay-web___NEXT_API_LAMBDA_0"
    }

  # module.tf_next.aws_lambda_function.this["__NEXT_API_LAMBDA_0"] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Managed by Terraform Next.js"
      + filename                       = "./.next-tf/lambdas/__NEXT_API_LAMBDA_0.zip"
      + function_name                  = "tf-nextjs-micropay-web___NEXT_API_LAMBDA_0"
      + handler                        = "now__launcher.launcher"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "zmHQHqpnm0EFHQY5sE5EOsq0p7r6ATgZ8ECyBDBzBpU="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 10
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.tf_next.aws_lambda_permission.current_version_triggers["__NEXT_API_LAMBDA_0"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action        = "lambda:InvokeFunction"
      + function_name = "tf-nextjs-micropay-web___NEXT_API_LAMBDA_0"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowInvokeFromApiGateway"
    }

  # module.tf_next.module.api_gateway.aws_apigatewayv2_api.this[0] will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "Managed by Terraform Next.js"
      + disable_execute_api_endpoint = false
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "tf-nextjs-micropay-web"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.tf_next.module.api_gateway.aws_apigatewayv2_integration.this["ANY /__NEXT_API_LAMBDA_0/{proxy+}"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = (known after apply)
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = 10000
    }

  # module.tf_next.module.api_gateway.aws_apigatewayv2_route.this["ANY /__NEXT_API_LAMBDA_0/{proxy+}"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /__NEXT_API_LAMBDA_0/{proxy+}"
      + target             = (known after apply)
    }

  # module.tf_next.module.api_gateway.aws_apigatewayv2_stage.default[0] will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = (known after apply)
    }

  # module.tf_next.module.next_image[0].aws_cloudfront_cache_policy.this will be created
  + resource "aws_cloudfront_cache_policy" "this" {
      + comment     = "Managed by Terraform Next.js image optimizer"
      + default_ttl = 86400
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 31536000
      + min_ttl     = 0
      + name        = "tf-nextjs-micropay-web_tfn-image_image-cache"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + enable_accept_encoding_brotli = true
          + enable_accept_encoding_gzip   = true

          + cookies_config {
              + cookie_behavior = "none"
            }

          + headers_config {
              + header_behavior = "whitelist"

              + headers {
                  + items = (known after apply)
                }
            }

          + query_strings_config {
              + query_string_behavior = "whitelist"

              + query_strings {
                  + items = [
                      + "q",
                      + "url",
                      + "w",
                    ]
                }
            }
        }
    }

  # module.tf_next.module.next_image[0].aws_cloudfront_origin_request_policy.this will be created
  + resource "aws_cloudfront_origin_request_policy" "this" {
      + comment = "Managed by Terraform Next.js image optimizer"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "tf-nextjs-micropay-web_tfn-image_request"

      + cookies_config {
          + cookie_behavior = "none"
        }

      + headers_config {
          + header_behavior = "whitelist"

          + headers {
              + items = (known after apply)
            }
        }

      + query_strings_config {
          + query_string_behavior = "whitelist"

          + query_strings {
              + items = [
                  + "q",
                  + "url",
                  + "w",
                ]
            }
        }
    }

  # module.tf_next.module.proxy_config.data.aws_iam_policy_document.cf_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cf_access"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.tf_next.module.proxy_config.aws_cloudfront_distribution.distribution will be created
  + resource "aws_cloudfront_distribution" "distribution" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "tf-nextjs-micropay-web - Proxy-Config"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods          = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id          = "b2884449-e4de-46a7-ac36-70bc7f1ddd6d"
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = false
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "88a5eaf4-2fd4-4709-b370-b4c650ea3fcf"
          + target_origin_id         = (known after apply)
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "allow-all"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = (known after apply)

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.tf_next.module.proxy_config.aws_cloudfront_origin_access_identity.this will be created
  + resource "aws_cloudfront_origin_access_identity" "this" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = (known after apply)
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.tf_next.module.proxy_config.aws_s3_bucket.proxy_config_store will be created
  + resource "aws_s3_bucket" "proxy_config_store" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "tf-nextjs-micropay-web-tfn-config"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.tf_next.module.proxy_config.aws_s3_bucket_object.config_json will be created
  + resource "aws_s3_bucket_object" "config_json" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=900"
      + content                = jsonencode(
            {
              + lambdaRoutes = [
                  + "/__NEXT_API_LAMBDA_0",
                ]
              + prerenders   = {}
              + routes       = [
                  + {
                      + continue = true
                      + headers  = {
                          + Location = "/$1"
                        }
                      + src      = "^(?:\\/((?:[^\\/]+?)(?:\\/(?:[^\\/]+?))*))\\/$"
                      + status   = 308
                    },
                  + {
                      + continue = true
                      + src      = "/404"
                      + status   = 404
                    },
                  + {
                      + handle = "filesystem"
                    },
                  + {
                      + check   = true
                      + dest    = "/__NEXT_API_LAMBDA_0"
                      + headers = {
                          + x-nextjs-page = "/api/auth"
                        }
                      + src     = "^/api/auth/?$"
                    },
                  + {
                      + check   = true
                      + dest    = "/__NEXT_API_LAMBDA_0"
                      + headers = {
                          + x-nextjs-page = "/api/nonce"
                        }
                      + src     = "^/api/nonce/?$"
                    },
                  + {
                      + handle = "resource"
                    },
                  + {
                      + src    = "/.*"
                      + status = 404
                    },
                  + {
                      + handle = "miss"
                    },
                  + {
                      + handle = "rewrite"
                    },
                  + {
                      + check   = true
                      + dest    = "/__NEXT_API_LAMBDA_0"
                      + headers = {
                          + x-nextjs-page = "/api/auth"
                        }
                      + src     = "^/api/auth/?$"
                    },
                  + {
                      + check   = true
                      + dest    = "/__NEXT_API_LAMBDA_0"
                      + headers = {
                          + x-nextjs-page = "/api/nonce"
                        }
                      + src     = "^/api/nonce/?$"
                    },
                  + {
                      + handle = "hit"
                    },
                  + {
                      + handle = "error"
                    },
                  + {
                      + dest   = "/404"
                      + src    = "/.*"
                      + status = 404
                    },
                ]
              + staticRoutes = [
                  + "/404",
                  + "/500",
                  + "/android-chrome-192x192.png",
                  + "/android-chrome-512x512.png",
                  + "/apple-touch-icon.png",
                  + "/favicon-16x16.png",
                  + "/favicon-32x32.png",
                  + "/favicon.ico",
                  + "/site.webmanifest",
                  + "/index",
                ]
            }
        )
      + content_type           = "application/json"
      + etag                   = "4e61e6bb7931ef6724bca8ce60bcadeb"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "proxy-config.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.tf_next.module.proxy_config.aws_s3_bucket_policy.proxy_config_store_origin_access will be created
  + resource "aws_s3_bucket_policy" "proxy_config_store_origin_access" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.tf_next.module.statics_deploy.data.aws_iam_policy_document.access_sqs_queue will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "access_sqs_queue"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.tf_next.module.statics_deploy.data.aws_iam_policy_document.access_static_deploy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "access_static_deploy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:GetObjectTagging",
              + "s3:ListBucket",
              + "s3:PutObject",
              + "s3:PutObjectTagging",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cloudfront:CreateInvalidation",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.tf_next.module.statics_deploy.data.aws_iam_policy_document.access_static_upload will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "access_static_upload"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:DeleteObjectVersion",
              + "s3:GetObject",
              + "s3:GetObjectVersion",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.tf_next.module.statics_deploy.data.aws_iam_policy_document.cf_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cf_access"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.tf_next.module.statics_deploy.data.aws_iam_policy_document.sqs_queue will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sqs_queue"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + (known after apply),
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.tf_next.module.statics_deploy.aws_cloudfront_origin_access_identity.this will be created
  + resource "aws_cloudfront_origin_access_identity" "this" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = (known after apply)
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.tf_next.module.statics_deploy.aws_s3_bucket.static_deploy will be created
  + resource "aws_s3_bucket" "static_deploy" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "tf-nextjs-micropay-web-tfn-static"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "Expire static assets"
          + tags    = {
              + "tfnextExpire" = "true"
            }

          + expiration {
              + days = 30
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.tf_next.module.statics_deploy.aws_s3_bucket.static_upload will be created
  + resource "aws_s3_bucket" "static_upload" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "tf-nextjs-micropay-web-tfn-deploy"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.tf_next.module.statics_deploy.aws_s3_bucket_notification.on_create will be created
  + resource "aws_s3_bucket_notification" "on_create" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # module.tf_next.module.statics_deploy.aws_s3_bucket_policy.origin_access will be created
  + resource "aws_s3_bucket_policy" "origin_access" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.tf_next.module.statics_deploy.aws_sns_topic.this will be created
  + resource "aws_sns_topic" "this" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "tf-nextjs-micropay-web"
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = (known after apply)
    }

  # module.tf_next.module.statics_deploy.aws_sns_topic_subscription.this will be created
  + resource "aws_sns_topic_subscription" "this" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.tf_next.module.statics_deploy.aws_sqs_queue.this will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = (known after apply)
      + name_prefix                       = "tf-nextjs-micropay-web"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 360
    }

  # module.tf_next.module.statics_deploy.aws_sqs_queue_policy.this will be created
  + resource "aws_sqs_queue_policy" "this" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # module.tf_next.module.statics_deploy.null_resource.static_s3_upload[0] will be created
  + resource "null_resource" "static_s3_upload" {
      + id       = (known after apply)
      + triggers = {
          + "static_files_archive" = "e67d53d1ed70bb8a482e6ac955fe4061"
        }
    }

  # module.tf_next.module.next_image[0].module.api_gateway.aws_apigatewayv2_api.this[0] will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "Managed by Terraform Next.js image optimizer"
      + disable_execute_api_endpoint = false
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "tf-nextjs-micropay-web_tfn-image"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.tf_next.module.next_image[0].module.api_gateway.aws_apigatewayv2_integration.this["GET /_next/{proxy+}"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = (known after apply)
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = 30000
    }

  # module.tf_next.module.next_image[0].module.api_gateway.aws_apigatewayv2_route.this["GET /_next/{proxy+}"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /_next/{proxy+}"
      + target             = (known after apply)
    }

  # module.tf_next.module.next_image[0].module.api_gateway.aws_apigatewayv2_stage.default[0] will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = (known after apply)
    }

  # module.tf_next.module.next_image[0].module.image_optimizer.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.tf_next.module.next_image[0].module.image_optimizer.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/tf-nextjs-micropay-web_tfn-image"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # module.tf_next.module.next_image[0].module.image_optimizer.aws_iam_policy.additional_json[0] will be created
  + resource "aws_iam_policy" "additional_json" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "tf-nextjs-micropay-web_tfn-image"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.tf_next.module.next_image[0].module.image_optimizer.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "tf-nextjs-micropay-web_tfn-image-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.tf_next.module.next_image[0].module.image_optimizer.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tf-nextjs-micropay-web_tfn-image"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.tf_next.module.next_image[0].module.image_optimizer.aws_iam_role_policy_attachment.additional_json[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_json" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tf-nextjs-micropay-web_tfn-image"
    }

  # module.tf_next.module.next_image[0].module.image_optimizer.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tf-nextjs-micropay-web_tfn-image"
    }

  # module.tf_next.module.next_image[0].module.image_optimizer.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Managed by Terraform Next.js image optimizer"
      + filename                       = "/terraform/.terraform/modules/tf_next.next_image.lambda_content/download/@millihq/tf-next-image-optimization/dist.zip"
      + function_name                  = "tf-nextjs-micropay-web_tfn-image"
      + handler                        = "handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "TRb93kSoXWPOp0oG3XuUG/e2Amf55JuWOmJp2WSmfKM="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.tf_next.module.next_image[0].module.image_optimizer.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action        = "lambda:InvokeFunction"
      + function_name = "tf-nextjs-micropay-web_tfn-image"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + qualifier     = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # module.tf_next.module.next_image[0].module.image_optimizer.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action        = "lambda:InvokeFunction"
      + function_name = "tf-nextjs-micropay-web_tfn-image"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # module.tf_next.module.proxy.module.edge_proxy.data.aws_arn.log_group_arn[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_arn" "log_group_arn"  {
      + account   = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + partition = (known after apply)
      + region    = (known after apply)
      + resource  = (known after apply)
      + service   = (known after apply)
    }

  # module.tf_next.module.proxy.module.edge_proxy.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.tf_next.module.proxy.module.edge_proxy.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/us-east-1.tf-nextjs-micropay-web_tfn-proxy"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # module.tf_next.module.proxy.module.edge_proxy.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "tf-nextjs-micropay-web_tfn-proxy-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.tf_next.module.proxy.module.edge_proxy.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "tf-nextjs-micropay-web_tfn-proxy-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "tf-nextjs-micropay-web_tfn-proxy",
        ]
    }

  # module.tf_next.module.proxy.module.edge_proxy.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "lambda.amazonaws.com",
                              + "edgelambda.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tf-nextjs-micropay-web_tfn-proxy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.tf_next.module.proxy.module.edge_proxy.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Managed by Terraform Next.js"
      + filename                       = "/terraform/.terraform/modules/tf_next.proxy.proxy_package/download/@millihq/terraform-next-proxy/dist.zip"
      + function_name                  = "tf-nextjs-micropay-web_tfn-proxy"
      + handler                        = "handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "82jtpw8BXUKtAHxbNx9/CyDpixRsPcUEkK2F5iVQM0k="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/tf-nextjs-micropay-web_tfn-deploy"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy.additional_jsons[0] will be created
  + resource "aws_iam_policy" "additional_jsons" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "tf-nextjs-micropay-web_tfn-deploy-0"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy.additional_jsons[1] will be created
  + resource "aws_iam_policy" "additional_jsons" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "tf-nextjs-micropay-web_tfn-deploy-1"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy.additional_jsons[2] will be created
  + resource "aws_iam_policy" "additional_jsons" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "tf-nextjs-micropay-web_tfn-deploy-2"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "tf-nextjs-micropay-web_tfn-deploy-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy_attachment.additional_jsons[0] will be created
  + resource "aws_iam_policy_attachment" "additional_jsons" {
      + id         = (known after apply)
      + name       = "tf-nextjs-micropay-web_tfn-deploy-0"
      + policy_arn = (known after apply)
      + roles      = [
          + "tf-nextjs-micropay-web_tfn-deploy",
        ]
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy_attachment.additional_jsons[1] will be created
  + resource "aws_iam_policy_attachment" "additional_jsons" {
      + id         = (known after apply)
      + name       = "tf-nextjs-micropay-web_tfn-deploy-1"
      + policy_arn = (known after apply)
      + roles      = [
          + "tf-nextjs-micropay-web_tfn-deploy",
        ]
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy_attachment.additional_jsons[2] will be created
  + resource "aws_iam_policy_attachment" "additional_jsons" {
      + id         = (known after apply)
      + name       = "tf-nextjs-micropay-web_tfn-deploy-2"
      + policy_arn = (known after apply)
      + roles      = [
          + "tf-nextjs-micropay-web_tfn-deploy",
        ]
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "tf-nextjs-micropay-web_tfn-deploy-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "tf-nextjs-micropay-web_tfn-deploy",
        ]
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tf-nextjs-micropay-web_tfn-deploy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_lambda_event_source_mapping.this["sqs_source"] will be created
  + resource "aws_lambda_event_source_mapping" "this" {
      + batch_size                    = 10
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Managed by Terraform Next.js"
      + filename                       = "/terraform/.terraform/modules/tf_next.statics_deploy.lambda_content/download/@millihq/terraform-next-deploy-trigger/dist.zip"
      + function_name                  = "tf-nextjs-micropay-web_tfn-deploy"
      + handler                        = "handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = 1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "36/6dUSR0IiQDugzwtIlpN47qg+pGrkkjHYZ/Aakn5I="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_lambda_permission.current_version_triggers["AllowExecutionFromS3Bucket"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action        = "lambda:InvokeFunction"
      + function_name = "tf-nextjs-micropay-web_tfn-deploy"
      + id            = (known after apply)
      + principal     = "s3.amazonaws.com"
      + qualifier     = (known after apply)
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromS3Bucket"
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_lambda_permission.current_version_triggers["InvalidationQueue"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action        = "lambda:InvokeFunction"
      + function_name = "tf-nextjs-micropay-web_tfn-deploy"
      + id            = (known after apply)
      + principal     = "sqs.amazonaws.com"
      + qualifier     = (known after apply)
      + source_arn    = (known after apply)
      + statement_id  = "InvalidationQueue"
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromS3Bucket"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action        = "lambda:InvokeFunction"
      + function_name = "tf-nextjs-micropay-web_tfn-deploy"
      + id            = (known after apply)
      + principal     = "s3.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromS3Bucket"
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_lambda_permission.unqualified_alias_triggers["InvalidationQueue"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action        = "lambda:InvokeFunction"
      + function_name = "tf-nextjs-micropay-web_tfn-deploy"
      + id            = (known after apply)
      + principal     = "sqs.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "InvalidationQueue"
    }

Plan: 67 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + custom_domain_name = "micropay.gg"

```

</details>

*Pusher: @notjustinshaw, Action: `pull_request`*